<template>
	<div class="container container-sm legal">
		<h2 class="mt-l">Пользовательское соглашение</h2>
		<section>
			<h3>Пользовательское Соглашение</h3>
			<p>
				Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует
				отношения между владельцем https://enlisted-stats.web.app/ (далее
				enlisted-stats или Администрация) с одной стороны и пользователем сайта
				с другой. Сайт enlisted-stats не является средством массовой информации.
			</p>
			<p>
				Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы
				не согласны с условиями данного соглашения, не используйте сайт
				enlisted-stats!
			</p>
		</section>
		<section>
			<h3>Предмет соглашения</h3>
			<p>
				Администрация предоставляет пользователю право на размещение на сайте
				следующей информации:
			</p>
			<ul>
				<li>- Текстовой информации</li>
			</ul>
		</section>
		<section>
			<h2>Права и обязанности сторон</h2>
			<h3>Пользователь имеет право:</h3>
			<ul>
				<li>- осуществлять поиск информации на сайте</li>
				<li>- получать информацию на сайте</li>
				<li>- создавать информацию для сайта</li>
				<li>- изменять рейтинг пользователей</li>
				<li>- использовать информацию сайта в личных некоммерческих целях</li>
			</ul>

			<h3>Администрация имеет право:</h3>
			<ul>
				<li>
					- по своему усмотрению и необходимости создавать, изменять, отменять
					правила
				</li>
				<li>- ограничивать доступ к любой информации на сайте</li>
				<li>- создавать, изменять, удалять информацию</li>
				<li>- удалять учетные записи</li>
			</ul>

			<h3>Пользователь обязуется:</h3>
			<ul>
				<li>
					- не распространять информацию, которая направлена на пропаганду
					войны, разжигание национальной, расовой или религиозной ненависти и
					вражды, а также иной информации, за распространение которой
					предусмотрена уголовная или административная ответственность
				</li>
				<li>- не нарушать работоспособность сайта</li>
				<li>
					- не использовать скрипты (программы) для автоматизированного сбора
					информации и/или взаимодействия с Сайтом и его Сервисами
				</li>
			</ul>

			<h3>Администрация обязуется:</h3>
			<ul>
				<li>
					- поддерживать работоспособность сайта за исключением случаев, когда
					это невозможно по независящим от Администрации причинам.
				</li>
			</ul>
		</section>

		<section>
			<h3>Ответственность сторон</h3>
			<ul>
				<li>
					- пользователь лично несет полную ответственность за распространяемую
					им информацию
				</li>
			</ul>
		</section>

		<section>
			<h3>Условия действия Соглашения</h3>
			<ul>
				<li>- Данное Соглашение вступает в силу при регистрации на сайте.</li>
				<li>
					- Соглашение перестает действовать при появлении его новой версии.
				</li>
				<li>
					- Администрация оставляет за собой право в одностороннем порядке
					изменять данное соглашение по своему усмотрению.
				</li>
				<li>
					- Администрация не оповещает пользователей об изменении в Соглашении.
				</li>
				<li>
					- Актуальная версия Пользовательского соглашения в свободном доступе
					расположена в сети Интернет по адресу
					https://enlisted-stats.web.app/user-agreement.
				</li>
			</ul>
		</section>
	</div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
	setup() {},
});
</script>
